# NewVertexIndexPairArray Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewVertexIndexPairArray Method
Application Class See Also
---
Returns an array that can hold VertexIndexPair objects.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public VertexIndexPairArray NewVertexIndexPairArray()
```

Visual Basic
---
```text
Public Function NewVertexIndexPairArray As VertexIndexPairArray
```

Visual C++
---
```text
public:
VertexIndexPairArray^ NewVertexIndexPairArray()
```

# ### Return Value
The new VertexIndexPairArray objects.
# See Also
Application Class
Autodesk.Revit.Creation Namespace